``` Terraform will perform the following actions:

  # aws_route53_record.beacon-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "beacon-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_beacon.galaxyproject.eu_A"
        name            = "beacon.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.230",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.beacon-import-galaxyproject will be created
  + resource "aws_route53_record" "beacon-import-galaxyproject" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "beacon-import.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # aws_route53_record.jenkins-workers-bronze[0] will be created
  + resource "aws_route53_record" "jenkins-workers-bronze" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "worker-0.bronze.build.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 7200
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_blockstorage_volume_v2.jenkins-workers-bronze-volume[0] will be created
  + resource "openstack_blockstorage_volume_v2" "jenkins-workers-bronze-volume" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for Jenkins worker-0.bronze.build.galaxyproject.eu"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "jenkins-workers-bronze-volume"
      + region            = (known after apply)
      + size              = 200
      + volume_type       = "default"
    }

  # openstack_blockstorage_volume_v3.beacon-vol will be created
  + resource "openstack_blockstorage_volume_v3" "beacon-vol" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for beacon VM"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "beacon-data-vol-1d28e361305ad42a"
      + region            = (known after apply)
      + size              = 128
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.beacon will be created
  + resource "openstack_compute_instance_v2" "beacon" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.small"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "beacon.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = "bc3a2a5c3c8653edf62327dd46757658ec380db6"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.beacon-import will be created
  + resource "openstack_compute_instance_v2" "beacon-import" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.tiny"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "5a31b410-4f09-4b6c-84eb-eb16ca237f0a"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "beacon-import.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.incoming will be updated in-place
  ~ resource "openstack_compute_instance_v2" "incoming" {
        id                  = "8a3205b9-0269-4fd6-aab8-cc94a2f848a6"
        name                = "incoming.galaxyproject.eu"
      ~ security_groups     = [
          - "public-ping",
            # (4 unchanged elements hidden)
        ]
        tags                = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # openstack_compute_instance_v2.jenkins-workers-bronze[0] will be created
  + resource "openstack_compute_instance_v2" "jenkins-workers-bronze" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "jenkins-worker-v60-j105-d1dfcf46c4cd-main"
      + key_pair            = "jenkins2"
      + name                = "worker-0.bronze.build.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "0cd3c1a9d50fa22664f4bfbf321c9a4aa50007a1"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.beacon-va will be created
  + resource "openstack_compute_volume_attach_v2" "beacon-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # openstack_compute_volume_attach_v2.jenkins-workers-bronze-va[0] will be created
  + resource "openstack_compute_volume_attach_v2" "jenkins-workers-bronze-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 9 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```